// На рахунку користувача є 23580 кредитів, значення зберігається в змінній credits (створи і привласни). 
// Користувач вирішив купити ремонтних дроїдів, які коштують по 3000 кредитів за штуку. 
// Ціна одного дроїда зберігається в змінній pricePerDroid (створи і привласни).
// При відвідуванні сторінки, використовуючи prompt, необхідно запитати кількість дроїдів,
//  які користувач хоче купити і зберегти в змінну. Написати скрипт який:
// Якщо в prompt була натиснута кнопка Cancel, виводить в консоль повідомлення 'Скасовано користувачем!'.
// В іншому випадку, розраховує загальну ціну замовлення і зберігає в змінній totalPrice.
// Перевіряє чи зможе користувач оплатити замовлення:
// якщо сума до оплати перевищує кількість кредитів на рахунку, вивести в консоль повідомлення 
// 'Недостатньо коштів на рахунку!'. 
// В іншому випадку необхідно порахувати залишок кредитів на рахунку і вивести повідомлення 
// 'Ви купили [число] дроїдів, на рахунку залишилося [число] кредитів.'.
let credits = 23580
let pricePerDroid = 3000
let requiredAmmoutOfDroids = Number.parseInt(prompt("Введіть бажану кількість дроідів:"))
let totalPrice

if (isNaN(requiredAmmoutOfDroids)) console.log("Скасовано користувачем!")
else {
    totalPrice = requiredAmmoutOfDroids * pricePerDroid
    if (credits > totalPrice) console.log("Ви купили",requiredAmmoutOfDroids,"дроїдів, на рахунку залишилося",credits-totalPrice,"кредитів.")
    else console.log("Недостатньо коштів на рахунку!")
}
