// Написати скрипт перевірки кількості товарів на складі. Є
//  змінні total (кількість товарів на складі) і ordered (одиниць товару в замовленні).
//  Порівняти ці значення і за результатами вивести:
// Якщо в замовленні вказано число, що перевищує кількість товарів на складі,
//  то вивести повідомлення "На складі недостатньо товарів!".
// В іншому випадку вивести повідомлення "Замовлення оформлено, з вами зв'яжеться менеджер".
// Перевірити працездатність коду з різними значеннями змінної ordered, наприклад 20, 80 і 130.
const total = 100;
const ordered = 50;

if (total > ordered) {
    console.log("Замовлення оформлено, з вами зв'яжеться менеджер")
} else {
    console.log("На складі недостатньо товарів!")
}
