// Оголосити дві змінні, які зберігають назву та ціну товару: name і price
// Присвоїти змінним наступні характеристики товару (відразу при оголошенні)

// назва: Генератор захисного поля
// ціна: 1000

// Використовуючи стандартний рядок вивести до консолі інформацію про товар, вийде:
//  'Обрано «Генератор захисного поля», ціна за штуку 1000 кредитів'.
// Присвоїти товару нову ціну - 2000
// Використовуючи стандартний рядок вивести до консолі інформацію про товар, вийде: 
// 'Обрано «Генератор захисного поля», ціна за штуку 2000 кредитів'.
const goodName = "Генератор захисного поля"
let goodPrice = 1000
console.log('Обрано «', goodName, '», ціна за штуку', goodPrice, 'кредитів.')
goodPrice = 2000
console.log('Обрано «', goodName, '», ціна за штуку', goodPrice, 'кредитів.')