// Користувач може оформити доставку товару до себе в країну, вказавши її при відвідуванні сторінки в prompt. 
// Візьміть до уваги, що користувач може ввести ім'я країни не тільки буквами нижнього регістра, а наприклад 'кИтАЙ'. 
// Написати скрипт який виводить повідомлення про вартість доставки в зазначену країну.
// Обов'язково використовуйте switch.Формат повідомлення: 'Доставка в[країна] буде коштувати[ціна] кредитів'.
// Але доставка є не скрізь, якщо зазначеної країни немає в списку, то вивести ло alert повідомлення
// 'У вашій країні доставка недоступна'.Нижче наведено список країн і вартість доставки.
// Китай - 100 кредитів
// Чилі - 250 кредитів
// Австралія - 170 кредитів
// Індія - 80 кредитів
// Ямайка - 120 кредитів
let userCountry = prompt("В нас є доставка до різних країн! Щоб дізнатися її вартість,введіть назву Вашої:").toLowerCase()
let deliveryCost
switch (userCountry) {
    case "китай":
        deliveryCost = 100
        break
    case "чилі":
        deliveryCost = 250
        break
    case "австралія":
        deliveryCost = 170
        break
    case "індія":
        deliveryCost = 80
        break
    case "ямайка":
        deliveryCost = 120
        break
    default:
        deliveryCost = -1
        break
}
if (deliveryCost !== -1) alert("Доставка в", userCountry.toUpperCase()[0]+userCountry.slice(1), "буде коштувати", deliveryCost, "кредитів")
else alert("У вашій країні доставка недоступна")
