// Функція checkStorage(available, ordered) 
// перевіряє можливість оформлення замовлення і повертає повідомлення про результат.
// Вона оголошує два параметри, значення яких будуть задаватися під час її виклику.
// available - доступна кількість товарів на складі
// ordered - одиниць товару в замовленні
// Використовуючи розгалуження, доповнити код функції таким чином, що:
// Якщо в замовленні ще немає товарів, тобто значення параметра ordered дорівнює 0,
// у змінну message присвоюється рядок "У замовленні немає товарів".
// Якщо товарів у замовленні більше, ніж доступно товарів на складі, то 
// у змінну message присвоюється рядок
// "Ваше замовлення занадто велике, на складі недостатньо товарів!".
// В іншому випадку у змінну message присвоюється рядок
// "Замовлення прийнято, наш менеджер зв'яжеться з Вами.".

function checkStorage(available = Number, ordered = Number) {
    let message;
    if (ordered === 0) message = "У замовленні немає товарів"
    else if (available > ordered) message = "Замовлення прийнято, наш менеджер зв'яжеться з Вами."
    else message = "Ваше замовлення занадто велике, на складі недостатньо товарів!"
    return message;
 }

 console.log(checkStorage(40,20))